#!/bin/bash
#Program
#	检测shell参数

echo "--------------------------------------"
echo '当前运行的脚本$0 :' "$0"
echo '当前的参数总数$# :' "$# 个"
echo '当前的一个一个的参数为$@ :' "$@"
echo '当前的参数字符串组合为为$* :' "$*"

[ $# -lt 2 ] && echo "输入的参数过少" && exit 0
echo "用户输入的参数有:$*"
echo "第一个参数为:$1，第二个参数为:$2"
echo "--------------------------------------"

#参数总个数大于2的直接用for循环输出每一个参数
if [ "$#" -gt 2 ]; then
	echo -e '\n参数大于2，开始用for循环输出参数...，注意for循环用$@来做words'
	index=1;
	for var in "$@"
	do
		echo "第${index}参数为:${var}";
	done 
fi


exit 0
