#!/bin/bash
#Program 
#	该程序主要测试shift功能
#Date
#Version 1.0

echo "-------------------------------------------------"
echo "用户运行脚本，提示用户想shift参数的个数，查看结果"
echo "-------------------------------------------------"

echo "执行的命令:$0 $*"
[ $# -lt 1 ] && echo "没有可Shift的参数！" && exit 1

#1.提示用户想shift的参数个数
read -p "输入想SHIFT的参数个数:" n

#2.开始移除参数
[ "$n" -lt 1 -o "$n" -gt "$#" ] && echo "SHIFT参数需要在1~$#之间!" && exit 1
shift $n
echo -n "经过SHIFT后，参数个数:$#，" 
[ $# -gt 0 ] && echo "剩余参数为 $@, \$0=>$0,\$1=>$1..." || echo "无剩余参数了！"
exit 0

