#!/bin/bash
#Program 
#	测试if...then...fi
#Version 1.0


echo "-------------------------------------------------------------------------------------------------------"
echo  "测试if...then...fi"
echo "注意点:"
echo "	1.[]内的与和或判断只能用 -a 和-o，不能用 && 和 || 要么就把表达式分开成[ exp1 ] && [ exp2 ]的形式;"
echo "	2.[]后面需要接;then,此处不能换行"
echo "	3.if...then...elif...then...else...fi形式也要注意1、2两点"
echo "-------------------------------------------------------------------------------------------------------"

read -p "请输入(Y/N):" input

#1.检测用户输入
if [ "$input" == "Y" -o "$input" == "y" ];then
	echo "OK,继续...."
elif [ "$input" == "N" -o "$input" == "n" ];then
	echo "NO,终止...."
else
	echo "输入的信息错误!" && exit 1
fi
exit 0
